wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/nrf52_platform/m_coms_ble.c
/**@brief Function for initializing HID Service.
 */
static void hids_init(void)
{
    ret_code_t                    err_code;
    ble_hids_init_t               hids_init_obj;
    


    uint8_t                       hid_info_flags;
	  uint8_t                      report_map[sizeof(s_hid_descriptor)];
	  uint8_t                      i;
  
	  memcpy(report_map, s_hid_descriptor, sizeof(s_hid_descriptor));

#if ( NUM_OF_INPUT_REPORTS != 0 )
	
  ble_hids_inp_rep_init_t     * p_input_report;
  static ble_hids_inp_rep_init_t     input_report_array[NUM_OF_INPUT_REPORTS];
  memset((void *)input_report_array, 0, sizeof(ble_hids_inp_rep_init_t));

	for (i = 0; i < NUM_OF_INPUT_REPORTS; i++)
	{
    // Initialize HID Service
    p_input_report                      = &input_report_array[i];
    p_input_report->max_len             = s_report_input_max_lens[i];
    p_input_report->rep_ref.report_id   = s_report_input_ref_id[i];
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr      = SEC_JUST_WORKS;
    p_input_report->sec.rd      = SEC_JUST_WORKS;
	
  }
	
#endif
	
#if ( NUM_OF_OUTPUT_REPORTS != 0)
	
	ble_hids_outp_rep_init_t    * p_output_report;
	static ble_hids_outp_rep_init_t    output_report_array[NUM_OF_OUTPUT_REPORTS];
	memset((void *)output_report_array, 0, sizeof(ble_hids_outp_rep_init_t));
	
	for (i = 0; i < NUM_OF_OUTPUT_REPORTS; i++)
	{
    p_output_report                      = &output_report_array[i];
    p_output_report->max_len             = s_report_output_max_lens[i];
    p_output_report->rep_ref.report_id   = s_report_output_ref_id[i];
    p_output_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_OUTPUT;

    p_output_report->sec.wr = SEC_JUST_WORKS;
    p_output_report->sec.rd = SEC_JUST_WORKS;
	}
	
#endif


#if ( NUM_OF_FEATURE_REPORTS != 0)
  
	ble_hids_feature_rep_init_t * p_feature_report;
	static ble_hids_feature_rep_init_t feature_report_array[NUM_OF_FEATURE_REPORTS];
	memset((void *)feature_report_array, 0, sizeof(ble_hids_feature_rep_init_t));
	
	for (i = 0; i < NUM_OF_FEATURE_REPORTS; i++)
	{
    p_feature_report                      = &feature_report_array[i];
    p_feature_report->max_len             = s_report_feature_max_lens[i];
    p_feature_report->rep_ref.report_id   = s_report_feature_ref_id[i];
    p_feature_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_FEATURE;

    p_feature_report->sec.rd              = SEC_JUST_WORKS;
    p_feature_report->sec.wr              = SEC_JUST_WORKS;
	}
	
#endif
	
	
    hid_info_flags = HID_INFO_FLAG_REMOTE_WAKE_MSK | HID_INFO_FLAG_NORMALLY_CONNECTABLE_MSK;

    memset(&hids_init_obj, 0, sizeof(hids_init_obj));

    hids_init_obj.evt_handler                    = on_hids_evt;
    hids_init_obj.error_handler                  = service_error_handler;
    hids_init_obj.is_kb                          = true;
    hids_init_obj.is_mouse                       = false;
    hids_init_obj.inp_rep_count                  = NUM_OF_INPUT_REPORTS;
#if ( NUM_OF_INPUT_REPORTS != 0 )	
    hids_init_obj.p_inp_rep_array                = input_report_array;
#endif	
    hids_init_obj.outp_rep_count                 = NUM_OF_OUTPUT_REPORTS;
#if ( NUM_OF_OUTPUT_REPORTS != 0 )		
    hids_init_obj.p_outp_rep_array               = output_report_array;
#endif	
    hids_init_obj.feature_rep_count              = NUM_OF_FEATURE_REPORTS;
#if ( NUM_OF_FEATURE_REPORTS != 0 )		
    hids_init_obj.p_feature_rep_array            = feature_report_array;
#endif		
    hids_init_obj.rep_map.data_len               = sizeof(s_hid_descriptor);
    hids_init_obj.rep_map.p_data                 = report_map;
    hids_init_obj.hid_information.bcd_hid        = s_ble_params.base_hid_version;
    hids_init_obj.hid_information.b_country_code = 0;
    hids_init_obj.hid_information.flags          = hid_info_flags;
    hids_init_obj.included_services_count        = 0;
    hids_init_obj.p_included_services_array      = NULL;

    hids_init_obj.rep_map.rd_sec         = SEC_JUST_WORKS;
    hids_init_obj.hid_information.rd_sec = SEC_JUST_WORKS;

    hids_init_obj.boot_kb_inp_rep_sec.cccd_wr = SEC_JUST_WORKS;
    hids_init_obj.boot_kb_inp_rep_sec.rd      = SEC_JUST_WORKS;

    hids_init_obj.boot_kb_outp_rep_sec.rd = SEC_JUST_WORKS;
    hids_init_obj.boot_kb_outp_rep_sec.wr = SEC_JUST_WORKS;

    hids_init_obj.protocol_mode_rd_sec = SEC_JUST_WORKS;
    hids_init_obj.protocol_mode_wr_sec = SEC_JUST_WORKS;
    hids_init_obj.ctrl_point_wr_sec    = SEC_JUST_WORKS;

    err_code = ble_hids_init(&m_hids, &hids_init_obj);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    qwr_init();
    dis_init();	
    bas_init();
    hids_init();
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = s_ble_params.conn_params.first_conn_params_update_delay;
    cp_init.next_conn_params_update_delay  = s_ble_params.conn_params.next_conn_params_update_delay;
    cp_init.max_conn_params_update_count   = s_ble_params.conn_params.max_conn_params_update_count;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = NULL;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling HID events.
 *
 * @details This function will be called for all HID events which are passed to the application.
 *
 * @param[in]   p_hids  HID service structure.
 * @param[in]   p_evt   Event received from the HID service.
 */
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt)
{
#if (NUM_OF_OUTPUT_REPORTS !=0)	
	  uint8_t    report_val, report_index;
#endif	
								
    switch (p_evt->evt_type)
    {
        case BLE_HIDS_EVT_BOOT_MODE_ENTERED:
            m_in_boot_mode = true;
            break;

        case BLE_HIDS_EVT_REPORT_MODE_ENTERED:
            m_in_boot_mode = false;
            break;

        case BLE_HIDS_EVT_REP_CHAR_WRITE:
					
#if (NUM_OF_OUTPUT_REPORTS !=0)
				
