wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/nrf52_platform/m_coms_ble.c
				   report_index = p_evt->params.char_write.char_id.rep_index;
					
				   if (p_evt->params.char_write.char_id.rep_type == BLE_HIDS_REP_TYPE_OUTPUT  && 
						   report_index == OUTPUT_REPORT_INDEX )
					 {
						 
						 // This code assumes that the output report is one byte long. Hence the following
            // static assert is made.
            STATIC_ASSERT(OUTPUT_REPORT_MAX_LEN == 1);	
				
						ret_code_t err_code = ble_hids_outp_rep_get(&m_hids,
                                             report_index,
                                             OUTPUT_REPORT_MAX_LEN,
                                             0,
                                             m_conn_handle,
                                             &report_val);
						APP_ERROR_CHECK(err_code); 
            coms_evt.type               = M_COMS_BLE_EVT_DATA_RECEIVED;
						coms_evt.data_received.len  = OUTPUT_REPORT_MAX_LEN;
						*coms_evt.data_received.data = report_val;
						//memcpy(coms_evt.data_received.data, &report_val, OUTPUT_REPORT_MAX_LEN);            
				    m_event_callback(&coms_evt,sizeof(coms_evt));
					 } 	 
#endif					 
            break;

        case BLE_HIDS_EVT_NOTIF_ENABLED:
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
             coms_evt.type = M_COMS_BLE_EVT_ADV_DIRECTED_HIGH_DUTY;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
             break;

        case BLE_ADV_EVT_DIRECTED:
					   coms_evt.type = M_COMS_BLE_EVT_ADV_DIRECTED;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
             break;

        case BLE_ADV_EVT_FAST:
					   coms_evt.type = M_COMS_BLE_EVT_ADV_FAST;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
             break;

        case BLE_ADV_EVT_SLOW:
             coms_evt.type = M_COMS_BLE_EVT_ADV_SLOW;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
            break;

        case BLE_ADV_EVT_FAST_WHITELIST:
             coms_evt.type = M_COMS_BLE_EVT_ADV_FAST_WHITELIST;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
             break;

        case BLE_ADV_EVT_SLOW_WHITELIST:
             coms_evt.type = M_COMS_BLE_EVT_ADV_SLOW_WHITELIST;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
             break;
	
        case BLE_ADV_EVT_IDLE:
					  is_adv_started = false;
					  coms_evt.type = M_COMS_BLE_EVT_ADV_IDLE;
				     m_event_callback(&coms_evt, sizeof(coms_evt));
            break;

        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
            ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            ble_gap_irk_t  whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
            uint32_t       addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
            uint32_t       irk_cnt  = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

            err_code = pm_whitelist_get(whitelist_addrs, &addr_cnt,
                                        whitelist_irks,  &irk_cnt);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_DEBUG("pm_whitelist_get returns %d addr in whitelist and %d irk whitelist",
                          addr_cnt, irk_cnt);

            // Set the correct identities list (no excluding peers with no Central Address Resolution).
            identities_set(PM_PEER_ID_LIST_SKIP_NO_IRK);

            // Apply the whitelist.
            err_code = ble_advertising_whitelist_reply(&m_advertising,
                                                       whitelist_addrs,
                                                       addr_cnt,
                                                       whitelist_irks,
                                                       irk_cnt);
            APP_ERROR_CHECK(err_code);
        } break; //BLE_ADV_EVT_WHITELIST_REQUEST

        case BLE_ADV_EVT_PEER_ADDR_REQUEST:
        {
            pm_peer_data_bonding_t peer_bonding_data;

            // Only Give peer address if we have a handle to the bonded peer.
            if (m_peer_id != PM_PEER_ID_INVALID)
            {
                err_code = pm_peer_data_bonding_load(m_peer_id, &peer_bonding_data);
                if (err_code != NRF_ERROR_NOT_FOUND)
                {
                    APP_ERROR_CHECK(err_code);

                    // Manipulate identities to exclude peers with no Central Address Resolution.
                    identities_set(PM_PEER_ID_LIST_SKIP_ALL);

                    ble_gap_addr_t * p_peer_addr = &(peer_bonding_data.peer_ble_id.id_addr_info);
                    err_code = ble_advertising_peer_addr_reply(&m_advertising, p_peer_addr);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; //BLE_ADV_EVT_PEER_ADDR_REQUEST

        default:
            break;
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
				     // Notify m_coms of event
				     is_adv_started = false;
             coms_evt.type = M_COMS_BLE_EVT_CONNECTED;
             m_event_callback(&coms_evt, sizeof(coms_evt));
				     m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
				                err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
             APP_ERROR_CHECK(err_code);
				     
				     							 
 				    break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");          
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
				    // Notify m_coms of event
            coms_evt.type = M_COMS_BLE_EVT_DISCONNECTED;
            m_event_callback(&coms_evt, sizeof(coms_evt));
            break; // BLE_GAP_EVT_DISCONNECTED

