wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/nrf52_platform/m_coms_ble.c
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
          
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;
				

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}




/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = s_ble_params.sec_params.bond;
    sec_param.mitm           = s_ble_params.sec_params.mitm;
    sec_param.lesc           = s_ble_params.sec_params.lesc;
    sec_param.keypress       = s_ble_params.sec_params.keypress;
    sec_param.io_caps        = s_ble_params.sec_params.io_capabilities;
    sec_param.oob            = s_ble_params.sec_params.oob_data_available;
    sec_param.min_key_size   = s_ble_params.sec_params.min_key_size;
    sec_param.max_key_size   = s_ble_params.sec_params.max_key_size;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

	  ble_uuid_t m_adv_uuids[] = {0, 0};
	  m_adv_uuids->uuid = s_ble_params.adv_params.uuid;
	  m_adv_uuids->type = s_ble_params.adv_params.uuid_type;	
		
    memset(&init, 0, sizeof(init));

    init.advdata.flags                             = s_ble_params.adv_params.adv_flags;
    init.advdata.name_type                         = s_ble_params.adv_params.name_type;
    init.advdata.include_appearance                = true;
    init.advdata.uuids_complete.uuid_cnt           = 1; 
    init.advdata.uuids_complete.p_uuids            = m_adv_uuids;	
    init.config.ble_adv_whitelist_enabled          = true;
    init.config.ble_adv_directed_high_duty_enabled = true;
    init.config.ble_adv_directed_enabled           = false;
    init.config.ble_adv_directed_interval          = 0;
    init.config.ble_adv_directed_timeout           = 0;
    init.config.ble_adv_fast_enabled               = true;
    init.config.ble_adv_fast_interval              = s_ble_params.adv_params.adv_fast_interval;
    init.config.ble_adv_fast_timeout               = s_ble_params.adv_params.adv_fast_timeout;
    init.config.ble_adv_slow_enabled               = false;  //<-- disable slow advertising
  //init.config.ble_adv_slow_interval              = s_ble_params.adv_params.adv_slow_interval;
  //init.config.ble_adv_slow_timeout               = s_ble_params.adv_params.adv_slow_timeout;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}



void m_coms_ble_init( const app_sched_event_handler_t p_event_callback)
{
	 ret_code_t err_code;


   if (p_event_callback == 0)
   {
       err_code = NRF_ERROR_INVALID_PARAM;
	 }
   else
   {
       err_code = NRF_SUCCESS;
   }		 
	 APP_ERROR_CHECK(err_code);
	 
	 m_event_callback = p_event_callback;
	 
	 ble_stack_init();	 

}

void m_coms_ble_enable(bool erase_bonds)
{
   gap_params_init();
	
	 gatt_init();
	
	 advertising_init();
	
	 services_init();
	
	 conn_params_init();
	
	 peer_manager_init();

	 if (erase_bonds == true)
   {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
   }
	 else
	 {	 
        advertising_start();
   }

		 

}

void m_coms_ble_disable(void)
{
  
}	



void m_coms_ble_hid_report_send(uint8_t report_id, uint8_t  * p_data )
{ 
	  ret_code_t err_code;
    
    if(m_conn_handle == BLE_CONN_HANDLE_INVALID )  
		{
       if (!is_adv_started)
			 {	 
			    advertising_start();    //Can only call once	
			 }				 
		}			
    else
		{	
	     if(m_in_boot_mode)

		   err_code = ble_hids_boot_kb_inp_rep_send(&m_hids, s_report_input_ref_index[report_id], p_data, m_conn_handle);
		
		   else
		
	     err_code = ble_hids_inp_rep_send(&m_hids, s_report_input_ref_index[report_id], s_report_input_max_lens[report_id], p_data, m_conn_handle);
			
