wrightLin/HID_Keyboard/nRF5_SDK_15.2.0_9412b96_0412/examples/ble_peripheral/source_code/nrf52_platform/m_coms_ble.c
			 //wright : TODO fix this error : 13313 =>0x3401
       //APP_ERROR_CHECK(err_code);
		}
}

void m_coms_ble_bas_send(uint8_t battery_level)
{	
	  ret_code_t err_code;
	
	  err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
	  if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_FORBIDDEN) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}	

void m_coms_ble_diconnect(void)
{
	
  	 ret_code_t err_code;
	
	
     err_code = sd_ble_gap_disconnect(m_conn_handle,
                                      BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
     if (err_code != NRF_ERROR_INVALID_STATE)
     {
                APP_ERROR_CHECK(err_code);
     }

}

void m_coms_ble_whitelist_off(void)
{
	ret_code_t err_code;
	
   if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
   {
       err_code = ble_advertising_restart_without_whitelist(&m_advertising);
       if (err_code != NRF_ERROR_INVALID_STATE)
       {
          APP_ERROR_CHECK(err_code);
       }
   }
}

void m_coms_ble_sleep_mode_enter(void)
{
	  ret_code_t err_code;
	
	  // Go to system-off mode (this function will not return; wakeup will cause a reset).
	
    err_code = sd_power_system_off();
	  if( err_code != NRF_ERROR_SOC_POWER_OFF_SHOULD_NOT_RETURN)
	  { 
      APP_ERROR_CHECK(err_code);
    } 
}	

/**
 * @}
 */
